#include <iostream>
#include "menu.h"
using namespace std;

// 显示初始菜单
void Menu::Start() {
    cout << "----------------------------------------------------------------"
         << endl
         << "                   欢迎来到图书馆图书管理系统！                    " << endl
         << "                  _________________________                     " << endl
         << "                 |                         |                    " << endl
         << "                 |        管理员后台         |                    " << endl
         << "                 |_________________________|                    " << endl
         << "----------------------------------------------------------------"
         << endl
         << "1: 登录                         📚📘 " << endl
         << "2: 注册                         📚📗 " << endl
         << "3: 测试                               " << endl
         << "0: 退出                         📚📙 " << endl
         << "> ";
}

// 显示主菜单
void Menu::Main() {
    cout << "----------------------------------------------------------------"
         << endl
         << "                    📚 主菜单 📚                                " << endl
         << "                 请选择一个选项进行操作：                         " << endl
         << "----------------------------------------------------------------"
         << endl
         << "1: 添加图书                      📕 " << endl
         << "2: 查找图书                      📘 " << endl
         << "3: 修改图书信息                  📗 " << endl
         << "4: 删除图书                      📙 " << endl
         << "5: 借阅管理                      📔 " << endl
         << "0: 登出                          ❌ " << endl
         << "> ";
}

// 显示查找菜单
void Menu::Find() {
    cout << "----------------------------------------------------------------"
         << endl
         << "                     🔍 查找图书 🔍                             " << endl
         << "                   请选择查找方式进行操作：                         " << endl
         << "----------------------------------------------------------------"
         << endl
         << "1: 按书号查找                   🔢 " << endl
         << "2: 按ISBN查找                  🆔 " << endl
         << "3: 查看所有图书                 📚 " << endl
         << "0: 返回上一级菜单                ↩️ " << endl
         << "> ";
}

// 显示更新菜单
void Menu::Update() {
    cout << "----------------------------------------------------------------"
         << endl
         << "                    ✏️ 修改图书信息 ✏️                          " << endl
         << "                   请选择修改方式进行操作：                         " << endl
         << "----------------------------------------------------------------"
         << endl
         << "1: 按书号修改                   🔢 " << endl
         << "2: 按ISBN修改                  🆔 " << endl
         << "0: 返回上一级菜单                ↩️ " << endl
         << "> ";
}

// 显示删除菜单
void Menu::Remove() {
    cout << "----------------------------------------------------------------"
         << endl
         << "                    🗑️ 删除图书 🗑️                              " << endl
         << "                  请选择删除方式进行操作：                         " << endl
         << "----------------------------------------------------------------"
         << endl
         << "1: 按书号删除                   ❌ " << endl
         << "2: 按ISBN删除                  ❌ " << endl
         << "0: 返回上一级菜单                ↩️ " << endl
         << "> ";
}

// 显示借阅或归还菜单
void Menu::LendOrReturn() {
    cout << "----------------------------------------------------------------"
         << endl
         << "                    📖 借阅或归还图书 📖                        " << endl
         << "                    请选择操作方式进行操作：                         " << endl
         << "----------------------------------------------------------------"
         << endl
         << "1: 借出图书                    📤 " << endl
         << "2: 归还图书                    📥 " << endl
         << "3: 查看所有已借出图书           📚 " << endl
         << "0: 返回上一级菜单               ↩️ " << endl
         << "> ";
}